app/controllers/articles_controller.rb

SELECT COUNT(*) FROM `articles`
INSERT INTO `articles` (`articleId`, `articleTitle`, `body`, `managerId`, `publicationDate`, `summary`) VALUES (2, 'ASDASD', 'asdasdasd', 1, '2014-10-24', 'asdasdasd')
---
  def create
    @article = Article.new(article_params)
    if Article.all.nil?
      @article.articleId=1
    else
      @article.articleId = Article.all.count+1
    end
    @article.managerId=current_user.id
    @article.publicationDate=Time.now
    @article.articleTitle= article_params[:articleTitle].upcase
    @article.save