app/controllers/catalog_controller.rb

  def index
  	@productsB = Product.where(:typeProduct => 'BIKE', :productStatus => 1)
---
SELECT `products`.* FROM `products`  WHERE `products`.`typeProduct` = 'BIKE' AND `products`.`productStatus` = 1