app/controllers/clients_controller.rb

SELECT `sales`.* FROM `sales`  WHERE `sales`.`clientId` = 1
---
  def show
    @sales = Sale.where(:clientId => @client.personId)

SELECT COUNT(*) FROM `clients`
INSERT INTO `clients` (`birthDay`, `document`, `email`, `lastName`, `personId`, `personName`, `personStatus`, `publicity`, `telephone`) VALUES ('1975-10-12', 17225114, 'charlypuert@gmail.com', 'Puerto', 1, 'Carlos', 1, 1, '3118694434')
---
  def create
    @client = Client.new(client_params)
    if Client.all.nil?
      @client.personId=1
    else
      @client.personId = Client.all.count+1
    end
    @client.personStatus=true
    @client.personName=client_params[:personName].titleize
    @client.lastName=client_params[:lastName].titleize
    @client.save

UPDATE `clients` SET `document` = 7225114 WHERE `clients`.`id` = 1
---
  def update
     respond_to do |format|
      if @client.update(client_params)

SELECT  `clients`.* FROM `clients`  WHERE `clients`.`id` = 1 LIMIT 1
---
  def set_client
    @client = Client.find(params[:id])