app/controllers/inventories_controller.rb

SELECT `products`.* FROM `products`
---
  def index
    @inventories = Product.all

SELECT `products`.* FROM `products`
---
  def new
    @inventory = Inventory.new
    @products=Product.all

INSERT INTO `inventories` (`agregationDate`, `productAmount`, `productId`) VALUES ('2014-10-24', 5, 3)
---
  def create
    @inventory = Inventory.new(inventory_params)
    @inventory.agregationDate=Time.now
    respond_to do |format|
      if @inventory.save

DELETE FROM `inventories` WHERE `inventories`.`id` = 2
---
  def destroy
    @inventory.destroy

SELECT  `inventories`.* FROM `inventories`  WHERE `inventories`.`id` = 10 LIMIT 1
---
    def set_inventory
      @inventory = Inventory.find(params[:id])