app/controllers/inventories_controller.rb

  def edit
    @products=Product.all
---
SELECT `products`.* FROM `products`