app/controllers/items_controller.rb

  def new
    @item = Item.new
    @products=Product.where(:productStatus => 1)
---
SELECT `products`.* FROM `products`  WHERE `products`.`productStatus` = 1

  def create
    @item = Item.new(item_params)
    #@item.saleId =@saleId
    @item.save
---
INSERT INTO `items` (`itemAmount`, `productId`, `saleId`) VALUES (1, 1, 1)