app/controllers/items_controller.rb

SELECT `products`.* FROM `products`
---
  def new
    @item = Item.new
    @products=Product.all