app/controllers/products_controller.rb

SELECT COUNT(*) FROM `products`
INSERT INTO `products` (`bikeType`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `measures`, `productDescription`, `productId`, `productName`, `productPrice`, `productReference`, `productStatus`, `productTradeMark`, `typeProduct`) VALUES ('Montaña', 'image/jpeg', 'Macina_Mini_Me_24_black_matt(orange).jpg', 268859, '2014-11-03 21:03:54', '109-2CM 09-12CM', 'Lo último de KTM', 1, 'Macina mini me', 1900000, 'OP31', 1, 'KTM', 'BIKE')
---
  def create
    @product = Product.new(product_params)
    if Product.all.nil?
      @product.productId=1
    else
      @product.productId = Product.all.count+1
    end
    @product.productStatus=true
    @product.productReference= product_params[:productReference].upcase
    @product.productName=product_params[:productName].capitalize
    @product.productTradeMark=product_params[:productTradeMark].upcase
    #@product.bikeType=product_params[:bikeType].capitalize
    @product.save

UPDATE `products` SET `image_file_name` = 'Macina_Mini_Me_24_black_matt(orange).jpg', `image_updated_at` = '2014-11-04 02:09:38' WHERE `products`.`id` = 1
---
  def update
    respond_to do |format|
      if @product.update(product_params)

UPDATE `products` SET `productStatus` = 0 WHERE `products`.`id` = 2
---
      end
      format.json { head :no_content }
    end
    @product.save