app/controllers/sales_controller.rb

SELECT `clients`.* FROM `clients`  WHERE `clients`.`personId` = 1
SELECT `sellers`.* FROM `sellers`  WHERE `sellers`.`personId` = 2
---
  def show
    @client=Client.where(:personId =>@sale.clientId)
    @seller=Seller.where(:personId =>@sale.sellerId)

SELECT `sellers`.* FROM `sellers`
SELECT `clients`.* FROM `clients`
---
  def new
    @sale = Sale.new
    @sellers=Seller.all
    @clients=Client.all

SELECT `clients`.* FROM `clients`
---
  def edit
    @sellers=Seller.all
    @clients=Client.all

SELECT COUNT(*) FROM `sales`
INSERT INTO `sales` (`clientId`, `note`, `saleDate`, `saleId`, `saleStatus`, `sellerId`) VALUES (1, 'Ninguna', '2014-11-03', 1, 1, 2)
---
  def create
    @sale = Sale.new(sale_params)
    if Sale.all.nil?
      @sale.saleId=1
    else
      @sale.saleId = Sale.all.count+1
    end
    @sale.saleStatus=true
    @sale.save

UPDATE `sales` SET `note` = 'Cambio Ropa' WHERE `sales`.`id` = 1
---
  def update
    respond_to do |format|
      if @sale.update(sale_params)

SELECT  `sales`.* FROM `sales`  WHERE `sales`.`id` = 1 LIMIT 1
---
  def set_sale
    @sale = Sale.find(params[:id])