app/controllers/sellers_controller.rb

  def index
   #@sellers = User.find(:all, :conditions => { :userType => 'Seller' })
   @sellers = Seller.all
---
SELECT `sellers`.* FROM `sellers`

def create
  @seller = Seller.new(seller_params)

  @seller.username=seller_params[:username].titleize
  @seller.userLastName=seller_params[:userLastName].titleize
  @seller.personId= User.all.count+1
  @seller.userType='Seller'
  @seller.status = 1
  @seller.password = "#{@seller.username}.#{@seller.userLastName}".downcase.gsub(/\s+/, "")
  @seller.save
---
SELECT COUNT(*) FROM `users`
INSERT INTO `sellers` (`document`, `email`, `password`, `personId`, `status`, `telephone`, `userLastName`, `userType`, `username`) VALUES (1059089109, 'carlost@gmail.com', 'carlos.tarazona', 2, 1, '3109213221', 'Tarazona', 'Seller', 'Carlos')
INSERT INTO `users` (`created_at`, `document`, `email`, `encrypted_password`, `personId`, `status`, `telephone`, `updated_at`, `userLastName`, `userType`, `username`) VALUES ('2014-11-03 20:36:17', 1059089109, 'carlost@gmail.com', '$2a$10$W4T27/3LOSsfe3mRKOwZPODl/qObZnWFyZp0ethwvDQtaPhknaYtO', 2, 1, '3109213221', '2014-11-03 20:36:17', 'Tarazona', 'Seller', 'Carlos')

def update

  @seller.update(seller_params)
  passwd="#{@seller.username}.#{@seller.userLastName}".downcase.gsub(/\s+/, "")
  if @reset==false
    @user  =  User.update(@seller.personId,
      :username => @seller.username,
      :email =>  @seller.email ,
      :userLastName =>@seller.userLastName,
      :document => @seller.document,
      :telephone => @seller.telephone)
---
UPDATE `sellers` SET `username` = 'Carlinhos' WHERE `sellers`.`id` = 1
UPDATE `users` SET `encrypted_password` = '$2a$10$o0IwKGlt5YNu0EU6dvP6NuZkU7qG9pJVtMj0V6v6SeQ/vPY8l4z8e', `updated_at` = '2014-11-03 20:37:10', `username` = 'Carlinhos' WHERE `users`.`id` = 2

def set_seller
  @seller = Seller.find(params[:id])
---
SELECT  `sellers`.* FROM `sellers`  WHERE `sellers`.`id` = 1 LIMIT 1